Revit 2027 API
BuiltInFailures.RebarCouplerFailures.DistanceBetweenBarsError Property
 This is used to post error. The distance between the connected ends of the bars exceeds 10 bar diameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DistanceBetweenBarsError { get; }
Public Shared ReadOnly Property DistanceBetweenBarsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DistanceBetweenBarsError {
	FailureDefinitionId^ get ();
}
static member DistanceBetweenBarsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace